In [1]:
import mysql.connector

In [2]:
mydb = mysql.connector.connect(host='localhost',user='ashish',password='ashishgavit@007')
mycursor = mydb.cursor()

# Create Database

In [3]:
mycursor.execute('drop database if exists mydatabase') 
try:
    mycursor.execute('create database mydatabase')
except mysql.connector.Error as err :
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)
mycursor.execute('show databases')
for x in mycursor:
    print(x)

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

# Create Table

In [4]:
mydb = mysql.connector.connect(host='localhost', user='ashish', password='ashishgavit@007', database='mydatabase')
mycursor = mydb.cursor()
try:
    mycursor.execute('create table customer (name varchar(255), address varchar(233))')
except mysql.connector.Error as err1:
    print(err1)
mycursor.execute('show tables')
for x in mycursor:
    print(x)

('customer',)

# Add new column in customer table

In [5]:
try:
    mycursor.execute('alter table customer add column id int auto_increment primary key')
except mysql.connector.Error as err:
    print(err)

# Insert data into the 'customer' table

In [6]:
sql = 'insert into customer(name, address) values(%s, %s)'
val = ('Ashish','Surat, Gujarat')
mycursor.execute(sql, val)
mydb.commit()
print(mycursor.rowcount, 'record inserted')

1 record inserted

# Insert multiple rows into the 'customer' table

In [7]:
sql = 'insert into customer(name, address) values(%s, %s)'
val = [
    ('Peter', 'Lowstreet 4'),
    ('Amy', 'Apple st 652'),
    ('Hannah', 'Mountain 21'),
    ('Michael', 'Valley 345'),
    ('Sandy', 'Ocean blvd 2'),
    ('Betty', 'Green Grass 1'),
    ('Richard', 'Sky st 331'),
    ('Susan', 'One way 98'),
    ('Vicky', 'Yellow Garden 2'),
    ('Ben', 'Park Lane 38'),
    ('William', 'Central st 954'),
    ('Chuck', 'Main Road 989'),
    ('Viola', 'Sideway 1633')
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, 'row was inserted.')

13 row was inserted.

# Select data from customer table

In [8]:
mycursor.execute('select * from customer')
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('Ashish', 'Surat, Gujarat', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)

# select columns from customer table

In [9]:
mycursor.execute('select name, address from customer')
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('Ashish', 'Surat, Gujarat')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')

# Fetch first row from customer table

In [10]:
mycursor.execute('select * from customer')
myresult = mycursor.fetchone()
print(myresult)

('Ashish', 'Surat, Gujarat', 1)

# select row with filter

In [11]:
mydb = mysql.connector.connect(host='localhost', user='ashish', password='ashishgavit@007', database='mydatabase')
mycursor = mydb.cursor()
mycursor.execute("select * from customer where address='Surat, Gujarat'")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('Ashish', 'Surat, Gujarat', 1)

# Select row with Wildcard Character

In [12]:
mycursor.execute('select * from customer where name like "%a%"')
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('Ashish', 'Surat, Gujarat', 1)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('William', 'Central st 954', 12)
('Viola', 'Sideway 1633', 14)

# Prevent SQL Injection

In [13]:
sql = 'select * from customer where address = %s'
adr = ('Surat, Gujarat',)
mycursor.execute(sql, adr)
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('Ashish', 'Surat, Gujarat', 1)

# Sort the result

In [14]:
mydb = mysql.connector.connect(host='localhost', user='ashish', password='ashishgavit@007', database='mydatabase')
mycursor = mydb.cursor()
sql = 'select name, address from customer order by name' # order by has 'asc' ascending as default
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('Amy', 'Apple st 652')
('Ashish', 'Surat, Gujarat')
('Ben', 'Park Lane 38')
('Betty', 'Green Grass 1')
('Chuck', 'Main Road 989')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Peter', 'Lowstreet 4')
('Richard', 'Sky st 331')
('Sandy', 'Ocean blvd 2')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Viola', 'Sideway 1633')
('William', 'Central st 954')

# Order by DESC

In [15]:
mycursor.execute('select * from customer order by name desc')
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('William', 'Central st 954', 12)
('Viola', 'Sideway 1633', 14)
('Vicky', 'Yellow Garden 2', 10)
('Susan', 'One way 98', 9)
('Sandy', 'Ocean blvd 2', 6)
('Richard', 'Sky st 331', 8)
('Peter', 'Lowstreet 4', 2)
('Michael', 'Valley 345', 5)
('Hannah', 'Mountain 21', 4)
('Chuck', 'Main Road 989', 13)
('Betty', 'Green Grass 1', 7)
('Ben', 'Park Lane 38', 11)
('Ashish', 'Surat, Gujarat', 1)
('Amy', 'Apple st 652', 3)

# Delete records

In [16]:
sql = 'delete from customer where address="Surat, Gujarat"'
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

# Prevent SQL Injection when deleting records

In [17]:
sql = 'delete from customer where address = %s'
adr = ('Yellow Garden 2',)
mycursor.execute(sql, adr)
print(mycursor.rowcount, 'record(s) deleted')

1 record(s) deleted

# View record function

In [18]:
from pprint import pprint
def connection():
    mydb = mysql.connector.connect(host='localhost', user='ashish', password='ashishgavit@007', database='mydatabase')
    return mydb

def viewRecord(sql, val=''):  
    mydb = connection()
    mycursor = mydb.cursor()
    if val == '':
        mycursor.execute(sql)
    else:
        mycursor.execute(sql, val)
    myresult = mycursor.fetchall()
    for x in myresult:
        pprint(x)

# Update table

In [19]:
sql = 'insert into customer (name, address) values(%s, %s)'
val = ('Ashish', 'Surat, Gujarat')
mycursor.execute(sql, val)
mydb.commit()
print(mycursor.rowcount, 'record(s) inserted')

1 record(s) inserted

In [20]:
sql = 'update customer set address = "Vapi" where address = "Surat, Gujarat"'
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, 'record(s) updated')

1 record(s) updated

In [21]:
sql, val = 'select * from customer', ''
viewRecord(sql)

('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Ashish', 'Vapi', 15)

# Prevent SQL Injection when updating table

In [22]:
sql = 'update customer set address=%s where address=%s'
adr = ('Surat, Gujarat', 'Vapi')
mycursor.execute(sql, adr)
mydb.commit()
print(mycursor.rowcount, 'record(s) updated')

1 record(s) updated

In [23]:
sql = 'select * from customer'
viewRecord(sql)

('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Ashish', 'Surat, Gujarat', 15)

# Limit the Result

In [24]:
mydb = connection()
mycursor = mydb.cursor()
mycursor.execute('select * from customer limit 5')
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)

# Start From Another Position

In [25]:
mydb = connection()
mycursor = mydb.cursor()
mycursor.execute('select * from customer limit 5 offset 2')
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)

# Join Two or More Tables

In [26]:
mycursor.execute('drop table if exists users')
mycursor.execute('create table users (id int auto_increment primary key, name varchar(255), fav int);')
mycursor.execute('drop table if exists products')
mycursor.execute('create table products (id int, name varchar(255));')
mydb = connection()
mycursor = mydb.cursor()
mycursor.execute('show tables')
for x in mycursor:
    print(x)

('customer',)
('products',)
('users',)

In [27]:
def insertRows(sql, val=''):
    mydb = connection()
    mycursor = mydb.cursor()
    if val == '':
        mycursor.execute(sql)
        mydb.commit()
    else:
        mycursor.executemany(sql, val)
        mydb.commit()
    print(mycursor.rowcount, 'record(s) inserted')

In [28]:
sql = 'insert into users (name, fav) values (%s, %s)'
val = [
    ('John', 154),
    ('Peter', 154),
    ('Amy', 155),
    ('Hannah',156),
    ('Michael',156),
    ('Ashish',None)
]
insertRows(sql, val)

6 record(s) inserted

In [29]:
sql = 'insert into products (id, name) values (%s, %s)'
val = [
    (154, 'Chocolate Heaven'),
    (155, 'Tasty Lemons'),
    (156, 'Vanilla Dreams'),
]
insertRows(sql, val)

3 record(s) inserted

In [30]:
mydb = connection()
mycursor = mydb.cursor()
# inner join, left join, right join
sql = 'select users.id, users.name as user, products.name as favorite from users left join products on users.fav = products.id'
# sql = "SELECT \
#   users.name AS user, \
#   products.name AS favorite \
#   FROM users \
#   INNER JOIN products ON users.fav = products.id"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
    pprint(x)

(1, 'John', 'Chocolate Heaven')
(2, 'Peter', 'Chocolate Heaven')
(3, 'Amy', 'Tasty Lemons')
(4, 'Hannah', 'Vanilla Dreams')
(5, 'Michael', 'Vanilla Dreams')
(6, 'Ashish', None)